<template>
	<div class="box"  @mouseleave.stop='conceal' @mouseenter="key = true">
		<dl>
			<dt>全部分类</dt>
			<dd v-for='(item,i) in menuArr' :key='i' @mousemove="models(i)">
				<i class="ico">&#xe63f;</i>
				{{item}}
				<span class="ico">&#xe61d;</span>
			</dd>
		</dl>
		<div class="box-small" v-show='key || key == 0'>
			<div v-for='(item,i) in boxSmall' :key='i' v-show='i == key'>
				<dl v-for='(obj,i) in item' :key='i'>
					<dt>{{obj.name}}<router-link to="/">更多<i class="ico">&#xe61d;</i></router-link></dt>
						<dd v-for='(cm,i) in obj.arr' :key='i'>
							<router-link to="/">{{cm}}</router-link>
						</dd>
				</dl>
			</div>
		</div>
	</div>
</template>
<script>
export default {
  data() {
    return {
      key: null,
      menuIcoArr: ['&#xe63f;', '&#xe606;', '&#xe601;', '&#xe644;', '&#xe6be;', '&#xe669;', '&#xe61a;', '&#xe6b9;', '&#xe628;', '&#xe6c7;', '&#xe619;', '&#xe61e;', '&#xe629;', '&#xe60e;', '&#xe607;', '&#xe76a;'],
      menuArr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      boxSmall: [[{
        name: '美食',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '2',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '3',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '4',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '5',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '6',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '7',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '8',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '9',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '10',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '11',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '12',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '13',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '14',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '15',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }], [{
        name: '16',
        arr: ['美食', '外卖', '酒店', '民宿', '猫眼电影', '机票 / 火车票', '休闲娱乐 / KTV', '生活服务', '丽人 / 婚纱摄影 / 医学美容', '亲子 / 儿童乐园 / 幼教', '运动健身 / 健身中心', '家装 / 建材 /家居', '学习培训 / 音乐培训', '医疗健康 / 宠物 / 爱车', '酒吧 / 密室逃脱'],
      }]],
      self: true,
    };
  },
  methods: {
    conceal() {
      setTimeout(() => {
        this.key = null;
      }, 200);
    },
    models(i) {
      if (this.self) {
        this.self = false;
        setTimeout(() => {
          this.self = true;
          this.key = i;
        }, 150);
      }
    },
  },
};
</script>
<style lang='scss' scoped>
   @import '@/assets/css/main/page/menu.scss';
</style>
